In [1]:
import os
import kagglehub
import pandas as pd

ModuleNotFoundError: No module named 'kagglehub'

In [2]:
path = kagglehub.dataset_download("rikdifos/credit-card-approval-prediction")

Downloading from https://www.kaggle.com/api/v1/datasets/download/rikdifos/credit-card-approval-prediction?dataset_version_number=3...

100%|██████████| 5.32M/5.32M [00:05<00:00, 1.00MB/s]

Extracting files...

In [2]:
app_record = pd.read_csv("./dataset/application_record.csv")
credit_record = pd.read_csv("./dataset/credit_record.csv")

In [3]:
app_record.shape

(438557, 18)

In [4]:
app_record.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [5]:
app_record.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 18 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438557 non-null  int64
 1   CODE_GENDER          438557 non-null  object
 2   FLAG_OWN_CAR         438557 non-null  object
 3   FLAG_OWN_REALTY      438557 non-null  object
 4   CNT_CHILDREN         438557 non-null  int64
 5   AMT_INCOME_TOTAL     438557 non-null  float64
 6   NAME_INCOME_TYPE     438557 non-null  object
 7   NAME_EDUCATION_TYPE  438557 non-null  object
 8   NAME_FAMILY_STATUS   438557 non-null  object
 9   NAME_HOUSING_TYPE    438557 non-null  object
 10  DAYS_BIRTH           438557 non-null  int64
 11  DAYS_EMPLOYED        438557 non-null  int64
 12  FLAG_MOBIL           438557 non-null  int64
 13  FLAG_WORK_PHONE      438557 non-null  int64
 14  FLAG_PHONE           438557 non-null  int64
 15  FLAG_EMAIL           438557 non-null  int64
 16  OCCUPATION_TYPE      304354 non-null  object
 17  CNT_FAM_MEMBERS      438557 non-null  float64
dtypes: float64(2), int64(8), object(8)
memory usage: 60.2+ MB

In [6]:
cols_drop = ["ID"]
app_record.drop(cols_drop, axis=1, inplace=True)

In [9]:
for col in app_record:
    print(f"{col}: {app_record[col].nunique()}")

CODE_GENDER: 2
FLAG_OWN_CAR: 2
FLAG_OWN_REALTY: 2
CNT_CHILDREN: 12
AMT_INCOME_TOTAL: 866
NAME_INCOME_TYPE: 5
NAME_EDUCATION_TYPE: 5
NAME_FAMILY_STATUS: 5
NAME_HOUSING_TYPE: 6
DAYS_BIRTH: 16379
DAYS_EMPLOYED: 9406
FLAG_MOBIL: 1
FLAG_WORK_PHONE: 2
FLAG_PHONE: 2
FLAG_EMAIL: 2
OCCUPATION_TYPE: 18
CNT_FAM_MEMBERS: 13